#!/usr/bin/env bash

# -----------------------------------------------------------------------------
# 全局变量
# -----------------------------------------------------------------------------

# 是否删除中间产物文件
DELETE_MID_PRODUCT="true"

# 证书过期时间 (日)
EXPIRE_DAYS=99999

# 密码
GLOBAL_PASS="changeit"

# 证书(DN) - 国家/地区
SUBJ_C="CN"

# 证书(DN) - 州/省
SUBJ_ST="Shanghai"

# 证书(DN) - 位置/市
SUBJ_L="Shanghai"

# 证书(DN) - 组织
SUBJ_O="Unknown"

# 证书(DN) - 组织单元
SUBJ_OU="Unknown"

# 证书(DN) - 通用名
SUBJ_CN="YingZhuo"

# -----------------------------------------------------------------------------
# 服务器端证书与秘钥
# -----------------------------------------------------------------------------

SERVER_STORE_ALIAS="server"
SERVER_STORE_PASS="$GLOBAL_PASS"

TRUST_STORE_ALIAS="trust"
TRUST_STORE_PASS="$GLOBAL_PASS"

# -----------------------------------------------------------------------------
# 客户端证书与秘钥
# -----------------------------------------------------------------------------
CLIENT_NAMES="bill coco"
CLIENT_STORE_PASS="$GLOBAL_PASS"

# -----------------------------------------------------------------------------
# JWT相关
# -----------------------------------------------------------------------------
JWT_ALIAS="jwt"
JWT_STORE_PASS="$GLOBAL_PASS"
